Core/src/Documents/НачисленияПоКредитамИЗаймам/НачисленияПоКредитамИЗаймам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачисленияПоКредитамИЗаймам</name>
  <registerRecords>AccumulationRegister.РасчетыНДФЛ</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоКредитамИЗаймам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийНачисленияПоКредитамИЗаймам</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ТипСуммы</name>
      <type>
        <types>EnumRef.ТипыСуммГрафикаКредитовИЗаймов</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКредитаЗайма</name>
      <type>
        <types>DocumentRef.ДоговорКредитаИЗайма</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаРасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисленияУдержанияНДФЛ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыОперацийНачисленияПоКредитамИЗаймам/ВидыОперацийНачисленияПоКредитамИЗаймам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийНачисленияПоКредитамИЗаймам</name>
  <enumValues>
    <name>НачисленияПоЗаймамСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>НачисленияПоКредитам</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыДоговоровКредитаИЗайма/ВидыДоговоровКредитаИЗайма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКредитаИЗайма</name>
  <enumValues>
    <name>ДоговорЗаймаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>КредитПолученный</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыСуммГрафикаКредитовИЗаймов/ТипыСуммГрафикаКредитовИЗаймов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСуммГрафикаКредитовИЗаймов</name>
  <enumValues>
    <name>ОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ОперацииПФ/ОперацииПФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииПФ</name>
  <enumValues>
    <name>Начисленный</name>
  </enumValues>
  <enumValues>
    <name>КОплате</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/НачисленияПоКредитамИЗаймам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаНачисленияПоКредитамИЗаймам, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("НачисленыПроцентыПоКредиту", НСтр("ka='კრედიტის (მიღებული) თაობაზე დარიცხულია პროცენტები';ru='Начислены проценты по кредиту (полученному)'"));
	Запрос.УстановитьПараметр("НачисленаКомиссияПоКредиту", НСтр("ka='(მიღებული) კრედიტის მიხედვით დარიცხულია კომისია';ru='Начислена комиссия по кредиту (полученному))'"));
	Запрос.УстановитьПараметр("НачисленыПроцентыПоЗайму", НСтр("ka='(გაცემულ) სესხზე დარიცხულია პროცენტები';ru='Начислены проценты по займу (выданному)'"));
	Запрос.УстановитьПараметр("НачисленаКомиссияПоЗайму", НСтр("ka='(გაცემულ) სესხზე დარიცხულია კომისია';ru='Начислена комиссия по займу (выданному))'"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачисленияПоКредитамИЗаймам);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачисленияПоКредитамИЗаймам.НачисленияПоКредитам)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачисленияПоКредитамИЗаймам.НачисленияПоКредитам)
	|			ТОГДА НачисленияПоКредитамИЗаймамНачисления.Контрагент
	|		ИНАЧЕ НачисленияПоКредитамИЗаймамНачисления.Сотрудник
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачисленияПоКредитамИЗаймам.НачисленияПоКредитам)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитПолученный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику)
	|	КОНЕЦ КАК ВидДоговора,
	|	НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
	|	НачисленияПоКредитамИЗаймамНачисления.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА НачисленияПоКредитамИЗаймамНачисления.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентыВал,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА НачисленияПоКредитамИЗаймамНачисления.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КомиссияВал,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|			ТОГДА ВЫРАЗИТЬ(НачисленияПоКредитамИЗаймамНачисления.Сумма * КурсыВалютУчета.Кратность * КурсыВалютРасчетов.Курс / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Проценты,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|			ТОГДА ВЫРАЗИТЬ(НачисленияПоКредитамИЗаймамНачисления.Сумма * КурсыВалютУчета.Кратность * КурсыВалютРасчетов.Курс / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Комиссия,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачисленияПоКредитамИЗаймам.НачисленияПоКредитам)
	|			ТОГДА ВЫБОР
	|					КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|						ТОГДА &НачисленаКомиссияПоКредиту
	|					ИНАЧЕ &НачисленыПроцентыПоКредиту
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Комиссия)
	|					ТОГДА &НачисленаКомиссияПоЗайму
	|				ИНАЧЕ &НачисленыПроцентыПоЗайму
	|			КОНЕЦ
	|	КОНЕЦ КАК СодержаниеПроводки
	|ИЗ
	|	Документ.НачисленияПоКредитамИЗаймам.Начисления КАК НачисленияПоКредитамИЗаймамНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО НачисленияПоКредитамИЗаймамНачисления.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|ГДЕ
	|	НачисленияПоКредитамИЗаймамНачисления.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоКредитамИЗаймам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПокупателями()

//T
Процедура СформироватьТаблицаРасчетыНДФЛ(ДокументСсылкаНачисленияПоКредитамИЗаймам, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	//Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	//Запрос.УстановитьПараметр("НачисленыПроцентыПоКредиту", НСтр("ka='კრედიტის (მიღებული) თაობაზე დარიცხულია პროცენტები';ru='Начислены проценты по кредиту (полученному)'"));
	//Запрос.УстановитьПараметр("НачисленаКомиссияПоКредиту", НСтр("ka='(მიღებული) კრედიტის მიხედვით დარიცხულია კომისია';ru='Начислена комиссия по кредиту (полученному))'"));
	//Запрос.УстановитьПараметр("НачисленыПроцентыПоЗайму", НСтр("ka='(გაცემულ) სესხზე დარიცხულია პროცენტები';ru='Начислены проценты по займу (выданному)'"));
	//Запрос.УстановитьПараметр("НачисленаКомиссияПоЗайму", НСтр("ka='(გაცემულ) სესხზე დარიცხულია კომისია';ru='Начислена комиссия по займу (выданному))'"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачисленияПоКредитамИЗаймам);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	//
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НачисленияПоКредитамИЗаймамНачисления.Ссылка.ДатаОкончания КАК Период,
	|	НачисленияПоКредитамИЗаймамНачисления.Ссылка.Организация,
	|	НачисленияПоКредитамИЗаймамНачисления.ВидНачисленияУдержанияНДФЛ КАК ВидНачисленияУдержания,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачисленияПоКредитамИЗаймам.НачисленияПоЗаймамСотрудникам)
	|			ТОГДА НачисленияПоКредитамИЗаймамНачисления.Сотрудник
	|		ИНАЧЕ НачисленияПоКредитамИЗаймамНачисления.Контрагент
	|	КОНЕЦ КАК Сотрудник,
	|	НачисленияПоКредитамИЗаймамНачисления.Ссылка.ДатаНачала КАК ПериодРегистрации,
	|	НачисленияПоКредитамИЗаймамНачисления.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
	|	&НачислениеНалога КАК СодержаниеПроводки,
	|	ВЫРАЗИТЬ(НачисленияПоКредитамИЗаймамНачисления.СуммаНДФЛ * КурсыВалютУчета.Кратность * КурсыВалютРасчетов.Курс / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	НачисленияПоКредитамИЗаймамНачисления.СуммаНДФЛ КАК СуммаВал
	|ИЗ
	|	Документ.НачисленияПоКредитамИЗаймам.Начисления КАК НачисленияПоКредитамИЗаймамНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО НачисленияПоКредитамИЗаймамНачисления.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|ГДЕ
	|	НачисленияПоКредитамИЗаймамНачисления.Ссылка = &Ссылка
	|	И НачисленияПоКредитамИЗаймамНачисления.СуммаНДФЛ <> 0";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", РезультатЗапроса.Выгрузить());
	
	
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПокупателями()


Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаНачисленияПоКредитамИЗаймам, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	//Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	//Запрос.УстановитьПараметр("НачисленыПроцентыПоКредиту", НСтр("ka='კრედიტის (მიღებული) თაობაზე დარიცხულია პროცენტები';ru='Начислены проценты по кредиту (полученному)'"));
	//Запрос.УстановитьПараметр("НачисленаКомиссияПоКредиту", НСтр("ka='(მიღებული) კრედიტის მიხედვით დარიცხულია კომისია';ru='Начислена комиссия по кредиту (полученному))'"));
	//Запрос.УстановитьПараметр("НачисленыПроцентыПоЗайму", НСтр("ka='(გაცემულ) სესხზე დარიცხულია პროცენტები';ru='Начислены проценты по займу (выданному)'"));
	//Запрос.УстановитьПараметр("НачисленаКомиссияПоЗайму", НСтр("ka='(გაცემულ) სესხზე დარიცხულია კომისია';ru='Начислена комиссия по займу (выданному))'"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачисленияПоКредитамИЗаймам);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	//
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("НачислениеНалога",	НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НачисленияПоКредитамИЗаймамНачисления.Ссылка.ДатаОкончания КАК Период,
	|	НачисленияПоКредитамИЗаймамНачисления.Ссылка.Организация КАК Организация,
	|	&НачислениеНалога КАК СодержаниеПроводки,
	|	ВЫРАЗИТЬ(НачисленияПоКредитамИЗаймамНачисления.СуммаНДФЛ * КурсыВалютУчета.Кратность * КурсыВалютРасчетов.Курс / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	НачисленияПоКредитамИЗаймамНачисления.ВидНачисленияУдержанияНДФЛ.ВидНалога КАК ВидНалога
	|ИЗ
	|	Документ.НачисленияПоКредитамИЗаймам.Начисления КАК НачисленияПоКредитамИЗаймамНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО НачисленияПоКредитамИЗаймамНачисления.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|ГДЕ
	|	НачисленияПоКредитамИЗаймамНачисления.Ссылка = &Ссылка
	|	И НачисленияПоКредитамИЗаймамНачисления.СуммаНДФЛ <> 0";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", РезультатЗапроса.Выгрузить());
	
	
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПокупателями()




// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаНачисленияПоКредитамИЗаймам, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НачисленияПоКредитамИЗаймамНачисления.Ссылка,
	|	НачисленияПоКредитамИЗаймамНачисления.НомерСтроки,
	|	НачисленияПоКредитамИЗаймамНачисления.ТипСуммы,
	|	НачисленияПоКредитамИЗаймамНачисления.Дата,
	|	НачисленияПоКредитамИЗаймамНачисления.Сотрудник,
	|	НачисленияПоКредитамИЗаймамНачисления.Контрагент,
	|	НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма,
	|	НачисленияПоКредитамИЗаймамНачисления.ВалютаРасчетов,
	|	НачисленияПоКредитамИЗаймамНачисления.Сумма КАК СуммаВал,
	|	ВЫРАЗИТЬ(НачисленияПоКредитамИЗаймамНачисления.Сумма * КурсыВалютУчета.Кратность * КурсыВалютРасчетов.Курс / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.Ссылка.ВидОперации = &НачисленияПоКредитам
	|			ТОГДА НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетЗатрат
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|					ТОГДА НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетУчетаПроцентов
	|				ИНАЧЕ НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетУчетаКомиссии
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетЗатрат,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.Ссылка.ВидОперации = &НачисленияПоКредитам
	|			ТОГДА НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетЗатратРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|					ТОГДА НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл
	|				ИНАЧЕ НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетУчетаКомиссииРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетЗатратРегл,
	|	НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетЗатратРегл КАК СчетУчетаДоходовИРасходовРегл,
	|	НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетЗатрат КАК СчетУчетаДоходовИРасходов,
	|	НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.Заказ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.Ссылка.ВидОперации = &НачисленияПоКредитам
	|			ТОГДА ВЫБОР
	|					КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|						ТОГДА НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетУчетаПроцентов
	|					ИНАЧЕ НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетУчетаКомиссии
	|				КОНЕЦ
	|		ИНАЧЕ НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетЗатрат
	|	КОНЕЦ КАК Корреспонденция,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.Ссылка.ВидОперации = &НачисленияПоКредитам
	|			ТОГДА ВЫБОР
	|					КОГДА НачисленияПоКредитамИЗаймамНачисления.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИЗаймов.Проценты)
	|						ТОГДА НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл
	|					ИНАЧЕ НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетУчетаКомиссииРегл
	|				КОНЕЦ
	|		ИНАЧЕ НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетЗатратРегл
	|	КОНЕЦ КАК КорреспонденцияРегл,
	|	НачисленияПоКредитамИЗаймамНачисления.СуммаНДФЛ КАК СуммаНДФЛВалюта,
	|	ВЫРАЗИТЬ(НачисленияПоКредитамИЗаймамНачисления.СуммаНДФЛ * КурсыВалютУчета.Кратность * КурсыВалютРасчетов.Курс / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаНДФЛ,
	|	ВЫБОР
	|		КОГДА НачисленияПоКредитамИЗаймамНачисления.ВидНачисленияУдержанияНДФЛ.ВидНалога.СчетУчетаРегл <> ЗНАЧЕНИЕ(ПланСчетов.хозрасчетный.пустаяссылка)
	|			ТОГДА НачисленияПоКредитамИЗаймамНачисления.ВидНачисленияУдержанияНДФЛ.ВидНалога.СчетУчетаРегл
	|	КОНЕЦ КАК СчетУчетаРегла,
	|	НачисленияПоКредитамИЗаймамНачисления.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл КАК СчетУчетаПроцентовРегл
	|ПОМЕСТИТЬ Начисления
	|ИЗ
	|	Документ.НачисленияПоКредитамИЗаймам.Начисления КАК НачисленияПоКредитамИЗаймамНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО НачисленияПоКредитамИЗаймамНачисления.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|ГДЕ
	|	НачисленияПоКредитамИЗаймамНачисления.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	//+++ Дмгг
	//|	ВЫБОР
	//|		КОГДА Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	//|				ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	//|		ИНАЧЕ Начисления.ДоговорКредитаЗайма.НаправлениеДеятельности
	//|	КОНЕЦ КАК НаправлениеДеятельности,
	//|	ВЫБОР
	//|		КОГДА Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	//|				ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	//|		ИНАЧЕ Начисления.СтруктурнаяЕдиница
	//|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов 
	|				И (Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов 
	|				И (Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		ИНАЧЕ Начисления.ДоговорКредитаЗайма.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов
	|					И (Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|					ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|					И (Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|					ИЛИ Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ИНАЧЕ Начисления.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	//--- Дмгг
	|	Начисления.СчетУчетаДоходовИРасходов КАК СчетУчета,
	|	Начисления.СчетУчетаДоходовИРасходовРегл КАК СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА Начисления.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачисленияПоКредитамИЗаймам.НачисленияПоЗаймамСотрудникам)
	|			ТОГДА Начисления.Сотрудник
	|		ИНАЧЕ Начисления.Контрагент
	|	КОНЕЦ КАК Аналитика,
	//+++ Дмгг
	//|	ВЫБОР
	//|		КОГДА Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	//|				ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	//|			ТОГДА НЕОПРЕДЕЛЕНО
	//|		ИНАЧЕ Начисления.ЗаказПокупателя
	//|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов
	|				И (Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|				И (Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Начисления.ЗаказПокупателя
	|	КОНЕЦ КАК ЗаказПокупателя,
	//--- Дмгг
	|	0 КАК СуммаДоходов,
	|	Начисления.Сумма + Начисления.СуммаНДФЛ КАК СуммаРасходов,
	|	Начисления.Сумма КАК Сумма,
	|	&СодержаниеПроводкиПрочихДоходовИРасходов КАК СодержаниеПроводки,
	|	Начисления.СуммаНДФЛ КАК СуммаНДФЛ,
	|	Начисления.СуммаНДФЛВалюта КАК СуммаНДФЛВалюта,
	|	Начисления.СчетУчетаРегла КАК СчетУчетаРегла
	|ИЗ
	|	Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка.ВидОперации = &НачисленияПоКредитам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	//+++ Дмгг
	//|	ВЫБОР
	//|		КОГДА Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	//|				ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	//|		ИНАЧЕ Начисления.ДоговорКредитаЗайма.НаправлениеДеятельности
	//|	КОНЕЦ КАК НаправлениеДеятельности,
	//|	ВЫБОР
	//|		КОГДА Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	//|				ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	//|		ИНАЧЕ Начисления.СтруктурнаяЕдиница
	//|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов 
	|				И (Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов 
	|				И (Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		ИНАЧЕ Начисления.ДоговорКредитаЗайма.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов
	|					И (Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|					ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|					И (Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|					ИЛИ Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ИНАЧЕ Начисления.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	//--- Дмгг
	|	Начисления.СчетУчетаДоходовИРасходов КАК СчетУчета,
	|	Начисления.СчетУчетаДоходовИРасходовРегл КАК СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА Начисления.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачисленияПоКредитамИЗаймам.НачисленияПоЗаймамСотрудникам)
	|			ТОГДА Начисления.Сотрудник
	|		ИНАЧЕ Начисления.Контрагент
	|	КОНЕЦ КАК Аналитика,
	//+++ Дмгг
	//|	ВЫБОР
	//|		КОГДА Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	//|				ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	//|			ТОГДА НЕОПРЕДЕЛЕНО
	//|		ИНАЧЕ Начисления.ЗаказПокупателя
	//|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользованиеТолькоРеглПланаСчетов
	|				И (Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ Начисления.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|				И (Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ Начисления.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Начисления.ЗаказПокупателя
	|	КОНЕЦ КАК ЗаказПокупателя,
	//--- Дмгг
	|	Начисления.Сумма КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	Начисления.Сумма КАК Сумма,
	|	&СодержаниеПроводкиПрочихДоходовИРасходов КАК СодержаниеПроводки,
	|	Начисления.СуммаНДФЛ КАК СуммаНДФЛ,
	|	Начисления.СуммаНДФЛВалюта КАК СуммаНДФЛВалюта,
	|	Начисления.СчетУчетаРегла КАК СчетУчетаРегла
	|ИЗ
	|	Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка.ВидОперации <> &НачисленияПоКредитам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	Начисления.СчетЗатрат КАК СчетДт,
	|	ВЫБОР
	|		КОГДА Начисления.СчетЗатрат.Валютный
	|			ТОГДА Начисления.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА Начисления.СчетЗатрат.Валютный
	|			ТОГДА Начисления.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалДт,
	|	Начисления.Корреспонденция КАК СчетКт,
	|	ВЫБОР
	|		КОГДА Начисления.Корреспонденция.Валютный
	|			ТОГДА Начисления.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА Начисления.Корреспонденция.Валютный
	|			ТОГДА Начисления.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалКт,
	|	Начисления.Сумма КАК Сумма,
	|	&СодержаниеПроводкиПрочихДоходовИРасходов КАК Содержание,
	|	Начисления.СуммаНДФЛ КАК СуммаНДФЛ,
	|	Начисления.СуммаНДФЛВалюта КАК СуммаНДФЛВалюта,
	|	Начисления.СчетУчетаРегла КАК СчетУчетаРегла
	|ИЗ
	|	Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Сумма > 0
	|	И Начисления.Ссылка.ВидОперации = &НачисленияПоКредитам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Начисления.НомерСтроки,
	|	Начисления.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	Начисления.СчетЗатрат,
	|	ВЫБОР
	|		КОГДА Начисления.СчетЗатрат.Валютный
	|			ТОГДА Начисления.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Начисления.СчетЗатрат.Валютный
	|			ТОГДА Начисления.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	Начисления.Корреспонденция,
	|	ВЫБОР
	|		КОГДА Начисления.Корреспонденция.Валютный
	|			ТОГДА Начисления.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Начисления.Корреспонденция.Валютный
	|			ТОГДА Начисления.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	Начисления.Сумма,
	|	&СодержаниеПроводкиПрочихДоходовИРасходов,
	|	Начисления.СуммаНДФЛ,
	|	Начисления.СуммаНДФЛВалюта,
	|	Начисления.СчетУчетаРегла
	|ИЗ
	|	Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Сумма > 0
	|	И Начисления.Ссылка.ВидОперации <> &НачисленияПоКредитам");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачисленияПоКредитамИЗаймам);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачисленияПоКредитам", Перечисления.ВидыОперацийНачисленияПоКредитамИЗаймам.НачисленияПоКредитам);
	Запрос.УстановитьПараметр("ИспользованиеТолькоРеглПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов); //+++ Дмгг
	
	Запрос.УстановитьПараметр("СодержаниеПроводкиПрочихДоходовИРасходов", НСтр("ka='ანგარიშსწორებები კრედიტების და სესხების მიხედვით';ru='Расчеты по кредитам и займам'"));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[1].Выгрузить());
	
	Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Количество() = 0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[2].Выгрузить());
	Иначе
		
		Выборка = МассивРезультатов[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", МассивРезультатов[3].Выгрузить());
	// Щербаков +++
	//Т
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_НачисленияПоКредитамИЗаймам(ДокументСсылкаНачисленияПоКредитамИЗаймам, СтруктураДополнительныеСвойства);
	// Щербаков ---
	
	// РасчетыПоКредитамИЗаймам
	СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаНачисленияПоКредитамИЗаймам, СтруктураДополнительныеСвойства);
	//T
	СформироватьТаблицаРасчетыНДФЛ(ДокументСсылкаНачисленияПоКредитамИЗаймам, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаНачисленияПоКредитамИЗаймам, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
